[
	{
		"title": "Senior Product Designer",
		"date": "2022 - 2024",
		"company": "Audio Visual Dynamics",
		"text": "<p></p><ul><li>Created 3D renderings in Vectorworks to visualize event layouts and ensure accurate AV and staging execution.</li><li>Designed scenic elements integrating brand colors and messages to enhance presence and engagement at expos.</li><li>Collaborated with teams to debug and optimize a logistics app, improving tracking of event components like LED walls and lighting.</li></ul>"
	},
	{
		"title": "Creative Director",
		"date": "2020 - 2022",
		"company": "CreditNinja",
		"location": "Chicago, IL",
		"text": "<p></p><ul><li>Led brand identity creation, including logo design and website refresh, to boost recognition and user experience.</li><li>Redesigned loan application UI/UX, increasing customer approvals and conversions by 20%.</li><li>Developed and maintained a design system in Figma, ensuring consistent brand assets across digital platforms.</li></ul>"
	},
	{
		"title": "Sr. Front-End Developer/Experience Designer",
		"date": "2017 - 2020",
		"company": "Aon",
		"location": "Chicago, IL",
		"text": "<p></p><ul><li>Led UX design for Aon's tech incubator team, creating intuitive user experiences for business-facing apps in collaboration with data scientists, project managers, and digital designers.</li><li>Developed interactive UI designs in Figma, Sketch, and Adobe XD; transformed concepts into code-based prototypes to demonstrate functionality and user flow.</li><li>Conducted A/B testing to optimize user experience and drive improvements across Aon's extensive application ecosystem.</li></ul>"
	},
	{
		"title": "Art Director, Web Developer, Sr. Experience Designer",
		"date": "2010 - 2017",
		"company": "Vibes Mobile Marketing",
		"location": "Chicago, IL",
		"text": "<p></p><ul><li>Led a team of 5 UI/UX designers in creating mobile ad campaigns for major brands, boosting CRM growth with targeted SMS marketing.</li><li>Oversaw development of interactive mobile experiences like games and trivia, enhancing user engagement and brand loyalty.</li><li>Managed end-to-end creative processes for high-impact campaigns, integrating brand messaging with mobile technologies.</li><li>Collaborated with developers and marketers to turn creative concepts into functional web apps, optimizing campaign performance.</ul>"
	}
]
